app/controllers/blogs_controller.rb

UPDATE "blogs" SET "title" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["title", "My Great Post"], ["updated_at", 2017-04-11 20:39:17 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)